vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/Luminary/pin_map.h
#define ADC3_PORT               (GPIO_PORTE_BASE)
#define ADC3_PIN                (GPIO_PIN_4)

#define ADC4_PORT               (GPIO_PORTD_BASE)
#define ADC4_PIN                (GPIO_PIN_7)

#define ADC5_PORT               (GPIO_PORTD_BASE)
#define ADC5_PIN                (GPIO_PIN_6)

#define ADC6_PORT               (GPIO_PORTD_BASE)
#define ADC6_PIN                (GPIO_PIN_5)

#define ADC7_PORT               (GPIO_PORTD_BASE)
#define ADC7_PIN                (GPIO_PIN_4)

#define C0O_PORT                (GPIO_PORTF_BASE)
#define C0O_PIN                 (GPIO_PIN_4)

#define C0_MINUS_PORT           (GPIO_PORTB_BASE)
#define C0_MINUS_PIN            (GPIO_PIN_4)

#define C0_PLUS_PORT            (GPIO_PORTB_BASE)
#define C0_PLUS_PIN             (GPIO_PIN_6)

#define C1O_PORT                (GPIO_PORTF_BASE)
#define C1O_PIN                 (GPIO_PIN_5)

#define C1_MINUS_PORT           (GPIO_PORTB_BASE)
#define C1_MINUS_PIN            (GPIO_PIN_5)

#define C1_PLUS_PORT            (GPIO_PORTC_BASE)
#define C1_PLUS_PIN             (GPIO_PIN_5)

#define CAN0RX_PORT             (GPIO_PORTD_BASE)
#define CAN0RX_PIN              (GPIO_PIN_0)

#define CAN0TX_PORT             (GPIO_PORTD_BASE)
#define CAN0TX_PIN              (GPIO_PIN_1)

#define CAN1RX_PORT             (GPIO_PORTF_BASE)
#define CAN1RX_PIN              (GPIO_PIN_0)

#define CAN1TX_PORT             (GPIO_PORTF_BASE)
#define CAN1TX_PIN              (GPIO_PIN_1)

#define CCP0_PORT               (GPIO_PORTB_BASE)
#define CCP0_PIN                (GPIO_PIN_0)

#define CCP1_PORT               (GPIO_PORTB_BASE)
#define CCP1_PIN                (GPIO_PIN_1)

#define CCP2_PORT               (GPIO_PORTC_BASE)
#define CCP2_PIN                (GPIO_PIN_4)

#define CCP3_PORT               (GPIO_PORTC_BASE)
#define CCP3_PIN                (GPIO_PIN_6)

#define CCP4_PORT               (GPIO_PORTC_BASE)
#define CCP4_PIN                (GPIO_PIN_7)

#define FAULT0_PORT             (GPIO_PORTG_BASE)
#define FAULT0_PIN              (GPIO_PIN_2)

#define FAULT1_PORT             (GPIO_PORTG_BASE)
#define FAULT1_PIN              (GPIO_PIN_4)

#define FAULT2_PORT             (GPIO_PORTG_BASE)
#define FAULT2_PIN              (GPIO_PIN_3)

#define FAULT3_PORT             (GPIO_PORTH_BASE)
#define FAULT3_PIN              (GPIO_PIN_2)

#define I2C0SCL_PORT            (GPIO_PORTB_BASE)
#define I2C0SCL_PIN             (GPIO_PIN_2)

#define I2C0SDA_PORT            (GPIO_PORTB_BASE)
#define I2C0SDA_PIN             (GPIO_PIN_3)

#define I2C1SCL_PORT            (GPIO_PORTA_BASE)
#define I2C1SCL_PIN             (GPIO_PIN_6)

#define I2C1SDA_PORT            (GPIO_PORTA_BASE)
#define I2C1SDA_PIN             (GPIO_PIN_7)

#define IDX0_PORT               (GPIO_PORTG_BASE)
#define IDX0_PIN                (GPIO_PIN_5)

#define NMI_PORT                (GPIO_PORTB_BASE)
#define NMI_PIN                 (GPIO_PIN_7)

#define PHA0_PORT               (GPIO_PORTF_BASE)
#define PHA0_PIN                (GPIO_PIN_6)

#define PHB0_PORT               (GPIO_PORTF_BASE)
#define PHB0_PIN                (GPIO_PIN_7)

#define PWM0_PORT               (GPIO_PORTG_BASE)
#define PWM0_PIN                (GPIO_PIN_0)

#define PWM1_PORT               (GPIO_PORTG_BASE)
#define PWM1_PIN                (GPIO_PIN_1)

#define PWM2_PORT               (GPIO_PORTH_BASE)
#define PWM2_PIN                (GPIO_PIN_0)

#define PWM3_PORT               (GPIO_PORTH_BASE)
#define PWM3_PIN                (GPIO_PIN_1)

#define PWM4_PORT               (GPIO_PORTF_BASE)
#define PWM4_PIN                (GPIO_PIN_2)

#define PWM5_PORT               (GPIO_PORTF_BASE)
#define PWM5_PIN                (GPIO_PIN_3)

#define PWM6_PORT               (GPIO_PORTG_BASE)
#define PWM6_PIN                (GPIO_PIN_6)

#define PWM7_PORT               (GPIO_PORTG_BASE)
#define PWM7_PIN                (GPIO_PIN_7)

#define SSI0CLK_PORT            (GPIO_PORTA_BASE)
#define SSI0CLK_PIN             (GPIO_PIN_2)

#define SSI0FSS_PORT            (GPIO_PORTA_BASE)
#define SSI0FSS_PIN             (GPIO_PIN_3)

#define SSI0RX_PORT             (GPIO_PORTA_BASE)
#define SSI0RX_PIN              (GPIO_PIN_4)

#define SSI0TX_PORT             (GPIO_PORTA_BASE)
#define SSI0TX_PIN              (GPIO_PIN_5)

#define SSI1CLK_PORT            (GPIO_PORTE_BASE)
#define SSI1CLK_PIN             (GPIO_PIN_0)

#define SSI1FSS_PORT            (GPIO_PORTE_BASE)
#define SSI1FSS_PIN             (GPIO_PIN_1)

#define SSI1RX_PORT             (GPIO_PORTE_BASE)
#define SSI1RX_PIN              (GPIO_PIN_2)

#define SSI1TX_PORT             (GPIO_PORTE_BASE)
#define SSI1TX_PIN              (GPIO_PIN_3)

#define SWCLK_PORT              (GPIO_PORTC_BASE)
#define SWCLK_PIN               (GPIO_PIN_0)

#define SWDIO_PORT              (GPIO_PORTC_BASE)
#define SWDIO_PIN               (GPIO_PIN_1)

#define SWO_PORT                (GPIO_PORTC_BASE)
#define SWO_PIN                 (GPIO_PIN_3)

#define TCK_PORT                (GPIO_PORTC_BASE)
#define TCK_PIN                 (GPIO_PIN_0)

#define TDI_PORT                (GPIO_PORTC_BASE)
#define TDI_PIN                 (GPIO_PIN_2)

#define TDO_PORT                (GPIO_PORTC_BASE)
#define TDO_PIN                 (GPIO_PIN_3)

#define TMS_PORT                (GPIO_PORTC_BASE)
#define TMS_PIN                 (GPIO_PIN_1)

#define U0RX_PORT               (GPIO_PORTA_BASE)
#define U0RX_PIN                (GPIO_PIN_0)

#define U0TX_PORT               (GPIO_PORTA_BASE)
#define U0TX_PIN                (GPIO_PIN_1)

#define U1RX_PORT               (GPIO_PORTD_BASE)
#define U1RX_PIN                (GPIO_PIN_2)

#define U1TX_PORT               (GPIO_PORTD_BASE)
#define U1TX_PIN                (GPIO_PIN_3)

#define USB0EPEN_PORT           (GPIO_PORTH_BASE)
#define USB0EPEN_PIN            (GPIO_PIN_3)

#define USB0PFLT_PORT           (GPIO_PORTH_BASE)
#define USB0PFLT_PIN            (GPIO_PIN_4)

#endif // PART_LM3S5749

//*****************************************************************************
//
// LM3S5752 Port/Pin Mapping Definitions
//
//*****************************************************************************
#ifdef PART_LM3S5752

#define ADC0_PORT               (GPIO_PORTE_BASE)
#define ADC0_PIN                (GPIO_PIN_3)

#define ADC1_PORT               (GPIO_PORTE_BASE)
#define ADC1_PIN                (GPIO_PIN_2)

#define ADC2_PORT               (GPIO_PORTE_BASE)
#define ADC2_PIN                (GPIO_PIN_1)

